from typing import List


def tri(integer_n: int) -> List[int]:
    def __zσQǂ__(
        __ZɭσǁΠΛξΩΘΔΛ▓ΠʑΛΘξ㎡zΛǂωΠΔΔΔΘΔξ: int,
        __ZǂΠξʑʑΩΩΠΛΔωωΩΔΩΔʑΩʑΞʑʑξΩΞΩΩΞΩΠωΝξʑΞΩ: int,
    ) -> bool:
        return __ZǂΠξʑʑΩΩΠΛΔωωΩΔΩΔʑΩʑΞʑʑξΩΞΩΩΞΩΠωΝξʑΞΩ % 2 == 0

    def __iΩΞΠξΩΩΩzΛ(
        ΛξΩΔΠΩΛΩΞξΩΠξΩΩΩΔΠΞΩΠ: int, 𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐: int
    ) -> List[int]:
        if 𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐 == 0:
            return [1]

        def λΞΞΩΩΠξξʑΩʑΔΠξΩΞΞΔΞΩΠΩΛΞΔʑΞΩΩΞΛξʑΞΠʑΛΠ(ΠΛΔξΩΩ: int) -> List[int]:
            if ΠΛΔξΩΩ == 2:
                return [1, 3]

            def ΠΩΩΔΠΛΩΞΩΩΔΩΩΛΛΛΞΩΩΠΛΛ(ξ𝓍ₓξ𝓸𝓉𝓁𝒸𝓉Ω: List[int]) -> List[int]:
                def __RXT𝓶𝓪𝓸𝓵𝓽𝓲𝓳𝓪(
                    𝓆𝓅𝓸𝓋𝓎𝓁𝓽𝒸𝓈𝓴: List[int],
                    𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐: int,
                    __UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ: int,
                ) -> List[int]:
                    if __UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ > 𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐:
                        return 𝓆𝓅𝓸𝓋𝓎𝓁𝓽𝒸𝓈𝓴
                    if __UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ % 2 == 0:
                        return __RXT𝓶𝓪𝓸𝓵𝓽𝓲𝓳𝓪(
                            𝓆𝓅𝓸𝓋𝓎𝓁𝓽𝒸𝓈𝓴
                            + [(__UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ // 2) + 1],
                            𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐,
                            __UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ + 1,
                        )
                    else:
                        # concatenate sum of last two elements plus ((index + 3)//2)
                        new_val = (
                            𝓆𝓅𝓸𝓋𝓎𝓁𝓽𝒸𝓈𝓴[__UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ - 1]
                            + 𝓆𝓅𝓸𝓋𝓎𝓁𝓽𝒸𝓈𝓴[__UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ - 2]
                            + ((__UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ + 3) // 2)
                        )
                        return __RXT𝓶𝓪𝓸𝓵𝓽𝓲𝓳𝓪(
                            𝓆𝓅𝓸𝓋𝓎𝓁𝓽𝒸𝓈𝓴 + [new_val],
                            𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐,
                            __UwΞξΛΞΞΠΞʑʑΛΞΞΖΞΞΞΩΠΞΞΠΠΛ + 1,
                        )

                return __RXT𝓶𝓪𝓸𝓵𝓽𝓲𝓳𝓪([1, 3], 𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐𝕐, 2)

            return ΠΩΩΔΠΛΩΞΩΩΔΩΩΛΛΛΞΩΩΠΛΛ(ΠΛΔξΩΩ)

        return λΞΞΩΩΠξξʑΩʑΔΠξΩΞΞΔΞΩΠΩΛΞΔʑΞΩΩΞΛξʑΞΠʑΛΠ(ΛξΩΔΠΩΛΩΞξΩΠξΩΩΩΔΠΞΩΠ)